// Лабараторна номер 1
// В цій лабараторній роботі я поясню принцип виконанння функції для видалення тасок із бекенда
//наша функція
case TASK_CONTEXT_ACTIONS.DELETE_TASK: {
    //Отримання завдання з дії:
    // У даному випадку з action.payload.task отримується завдання, яке потрібно видалити.
    const task = action.payload.task
    //Фільтрація завдань: Використовується метод filter для створення нового списку завдань,
    // який не включає завдання з _id, що збігається з _id завдання, яке потрібно видалити.
    const tasks = state.tasks.filter((item) => item._id !== task._id)
    //Повернення нового стану: Новий стан повертається з оновленим списком завдань.
    //Інші властивості стану залишаються незмінними, завдяки використанню оператору розпакування (...state).
    return {
        ...state,
        tasks: tasks
    }
}
//Принципи роботи:
// Деструктуризація дії: Завдання, яке потрібно видалити, витягується з action.payload.
// Фільтрація списку: Створюється новий список завдань без завдання, що потрібно видалити.
// Оновлення стану: Повертається новий об'єкт стану з оновленим списком завдань.